Tekla.Structures.Filtering.StringConstantFilterExpression
The StringConstantFilterExpression class represents a constant string filter expression.

Tekla.Structures.Filtering.StringConstantFilterExpression.#ctor(System.String)
Initializes a new instance of the StringConstantFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.StringConstantFilterExpression.#ctor(System.Collections.Generic.IEnumerable{System.String})
Initializes a new instance of the StringConstantFilterExpression class.
Values: The value to represent.